logs/manage_service_20150607.log

2015-06-07T00:59:33+02:00|DEBUG|service|Ssg\Controller\ServiceController|enable|6013202000002998|enable service request
2015-06-07T00:59:41+02:00|INFO|service|Ssg\Controller\ServiceController|enable|6013202000002998|enable service result|result:9|result_desc:Service already enabled.
2015-06-07 19:19:02,060|DEBUG|service|Ssg\Controller\ServiceController|enable|6013202000002998|enable service request
2015-06-07 19:20:13,958|DEBUG|service|Ssg\Controller\ServiceController|enable|6013202000002998|enable service request
2015-06-07 19:20:14,108|ERROR|service|Ssg\Model\ServiceModel|getService|{service_id}|error executing the query|00000|SELECT id, service_id, service_name, service_type, short_code, service_endpoint, 
				criteria, delivery_notification_endpoint, interface_name, correlator, status
                FROM tbl_services WHERE service_id = :service_id LIMIT 1|bind_parameters:null
2015-06-07 19:20:14,113|INFO|service|Ssg\Controller\ServiceController|enable|6013202000002998|enable service result|result:5|result_desc:Error executing a query.
2015-06-07 19:20:52,949|DEBUG|service|Ssg\Controller\ServiceController|enable|6013202000002998|enable service request
2015-06-07 19:20:53,046|INFO|service|Ssg\Controller\ServiceController|enable|6013202000002998|enable service result|result:9|result_desc:Service already enabled.
2015-06-07 19:21:00,701|DEBUG|service|Ssg\Controller\ServiceController|disable|6013202000002998|disable service request
2015-06-07 19:21:18,245|DEBUG|service|Ssg\Core\SDP|stopSmsNotification|6013202000002998|sending stop sms notification|http://196.201.216.14:8310/SmsNotificationManagerService/services/SmsNotificationManager||<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://www.huawei.com.cn/schema/common/v2_1" xmlns:loc="http://www.csapi.org/schema/parlayx/sms/notification_manager/v2_3/local"><soapenv:Header><v2:RequestSOAPHeader><spId>601320</spId><spPassword>a4f7a0afd315b42cdc5c75936ac7dc62</spPassword><serviceId>6013202000002998</serviceId><timeStamp>20150607192100</timeStamp></v2:RequestSOAPHeader></soapenv:Header><soapenv:Body><loc:stopSmsNotification><correlator>20150605132150</correlator></loc:stopSmsNotification></soapenv:Body></soapenv:Envelope>
2015-06-07 19:21:18,442|INFO|service|Ssg\Controller\ServiceController|disable|6013202000002998|disable service|result:0|result_desc:Saving successful
2015-06-07 19:21:18,457|DEBUG|service|Ssg\Controller\ServiceController|enable|6013202000002998|enable service request
2015-06-07 19:21:18,725|DEBUG|service|Ssg\Core\SDP|startSmsNotification|6013202000002998|sending start sms notification|http://196.201.216.14:8310/SmsNotificationManagerService/services/SmsNotificationManager||<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://www.huawei.com.cn/schema/common/v2_1" xmlns:loc="http://www.csapi.org/schema/parlayx/sms/notification_manager/v2_3/local"><soapenv:Header><RequestSOAPHeader xmlns="http://www.huawei.com.cn/schema/common/v2_1"><spId>601320</spId><spPassword>04076d56aa99d347e01036d2747ade53</spPassword><serviceId>6013202000002998</serviceId><timeStamp>20150607192118</timeStamp></RequestSOAPHeader></soapenv:Header><soapenv:Body><loc:startSmsNotification><loc:reference><endpoint>http://41.222.9.250:49200/ssg/notify/sms/</endpoint><interfaceName>startSmsNotification</interfaceName><correlator>20150607192118</correlator></loc:reference><loc:smsServiceActivationNumber>901</loc:smsServiceActivationNumber><loc:criteria>test2</loc:criteria></loc:startSmsNotification></soapenv:Body></soapenv:Envelope>
2015-06-07 19:21:25,665|INFO|service|Ssg\Controller\ServiceController|enable|6013202000002998|enable service result|result:0|result_desc:Saving successful
2015-06-07 19:21:56,150|DEBUG|service|Ssg\Controller\ServiceController|enable|6013202000002998|enable service request
2015-06-07 19:21:56,160|INFO|service|Ssg\Controller\ServiceController|enable|6013202000002998|enable service result|result:9|result_desc:Service already enabled.
2015-06-07 19:22:04,022|DEBUG|service|Ssg\Controller\ServiceController|disable|6013202000002998|disable service request
2015-06-07 19:22:19,684|DEBUG|service|Ssg\Core\SDP|stopSmsNotification|6013202000002998|sending stop sms notification|http://196.201.216.14:8310/SmsNotificationManagerService/services/SmsNotificationManager||<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://www.huawei.com.cn/schema/common/v2_1" xmlns:loc="http://www.csapi.org/schema/parlayx/sms/notification_manager/v2_3/local"><soapenv:Header><v2:RequestSOAPHeader><spId>601320</spId><spPassword>80c55da92989c7965a212150bbbfc0d1</spPassword><serviceId>6013202000002998</serviceId><timeStamp>20150607192204</timeStamp></v2:RequestSOAPHeader></soapenv:Header><soapenv:Body><loc:stopSmsNotification><correlator>20150607192118</correlator></loc:stopSmsNotification></soapenv:Body></soapenv:Envelope>
2015-06-07 19:22:19,741|INFO|service|Ssg\Controller\ServiceController|disable|6013202000002998|disable service|result:0|result_desc:Saving successful
2015-06-07 19:22:30,405|DEBUG|service|Ssg\Controller\ServiceController|enable|6013202000002998|enable service request
2015-06-07 19:22:30,445|DEBUG|service|Ssg\Core\SDP|startSmsNotification|6013202000002998|sending start sms notification|http://196.201.216.14:8310/SmsNotificationManagerService/services/SmsNotificationManager||<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://www.huawei.com.cn/schema/common/v2_1" xmlns:loc="http://www.csapi.org/schema/parlayx/sms/notification_manager/v2_3/local"><soapenv:Header><RequestSOAPHeader xmlns="http://www.huawei.com.cn/schema/common/v2_1"><spId>601320</spId><spPassword>a6a03b90a8f47ff6df383a0fc14ce55c</spPassword><serviceId>6013202000002998</serviceId><timeStamp>20150607192230</timeStamp></RequestSOAPHeader></soapenv:Header><soapenv:Body><loc:startSmsNotification><loc:reference><endpoint>http://41.222.9.250:49200/ssg/notify/sms/</endpoint><interfaceName>startSmsNotification</interfaceName><correlator>20150607192230</correlator></loc:reference><loc:smsServiceActivationNumber>901</loc:smsServiceActivationNumber><loc:criteria>test2</loc:criteria></loc:startSmsNotification></soapenv:Body></soapenv:Envelope>
2015-06-07 19:22:35,075|INFO|service|Ssg\Controller\ServiceController|enable|6013202000002998|enable service result|result:0|result_desc:Saving successful
